import sqlite3

def create_db():
# читаємо файл зі скриптом для створення БД
    with open('salary.sql', 'r') as f:
        sql = f.read()

# створюємо з'єднання з БД (якщо файлу з БД немає, він буде створений)
    with sqlite3.connect('salary.db') as con:
        cur = con.cursor()
# виконуємо скрипт із файлу, який створить таблиці в БД
        cur.executescript(sql)

if __name__ == "__main__":
    create_db()

'''Після виконання скрипту в корені проєкту повинен з'явитися файл salary.db. 
Поки що він порожній, і ми його заповнимо фейковими даними згодом.
Зараз за допомогою програми DBeaver виконайте підключення до БД.
Запустимо програму та на панелі інструментів виберемо нове підключення до БД SQLite. 
Через кнопку 'Open...' виберемо створений файл salary.db та натиснемо кнопку 'Finish'. 
Все, підключення створено.
Двічі натиснемо на 'Tables' і праворуч виберемо вкладку 'ER Diagram'. Там повинна бути 
зображена ER-діаграма нашої БД.'''